##### Problem 1: Create a dataframe to display the result as below:

<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/Student_data.png" width="300" alt="Student Data">
</center>

In [3]:
#write your code here
import pandas as pd 

set = {'Student': ['David', 'Samuel', 'Terry', 'Evan'], 'Age': [27, 24, 22, 32], 'Country': [ 'UK', 'Canada', 'China', 'USA'], 'Course': ['Python', 'Data Structures', 'Machine Learning', 'Web Development'], 'Marks': [85, 72, 89, 76]}

df = pd.DataFrame(set)
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

##### Problem 2: Retrieve the Marks column and assign it to a variable b

In [4]:
#write your code here
b = df[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

##### Problem 3: Retrieve the Country and Course columns and assign it to a variable c

In [5]:
#write your code here
c = df[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

##### Problem 4: View the column as a serie

In [6]:
#write your code here
x = df['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

##### Problem 5: Use the loc() function,to get the course of Samuel in the newly created dataframe df2.

In [25]:
df2 = df
df2=df2.set_index("Student")
df.head()

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [14]:
df2.loc['Samuel', 'Course']

'Data Structures'

##### Problem 6: Use the iloc() function to get the mark of Terry in the newly created dataframe df2.

In [24]:
df2.iloc[2, 3]

89